example_code2.txt
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MongoDbClient -P /tmp/ycsb/config/mongodb.conf -P workloads/workloada -P /tmp/ycsb/config/large.dat -s -threads 10 -target 100 -p measurementtype=timeseries -p timeseries.granularity=1000 -t
new database url = 172.16.32.7:27017/ycsb
 0 sec: 0 operations; 
mongo connection created with 172.16.32.7:27017/ycsb
 10 sec: 968 operations; 96.48 current ops/sec;   
 20 sec: 1968 operations; 99.96 current ops/sec;   
 30 sec: 2968 operations; 99.99 current ops/sec;   
 40 sec: 3969 operations; 100.04 current ops/sec;   
 50 sec: 4969 operations; 99.99 current ops/sec;   
 60 sec: 5970 operations; 100.09 current ops/sec;   
 70 sec: 6970 operations; 99.99 current ops/sec;   
 80 sec: 7970 operations; 100 current ops/sec;   
 90 sec: 8970 operations; 99.99 current ops/sec;   
 100 sec: 9970 operations; 99.99 current ops/sec;   
 100 sec: 10000 operations; 75.76 current ops/sec;    
[OVERALL], RunTime(ms), 100446.0
[OVERALL], Throughput(ops/sec), 99.55598032773828
[UPDATE], Operations, 5005
[UPDATE], AverageLatency(us), 2445.5976023976023
[UPDATE], MinLatency(us), 993
[UPDATE], MaxLatency(us), 24758
[UPDATE], Return=1, 5005
[UPDATE], 0, 3196.9830508474574
[UPDATE], 1000, 3169.7755102040815
[UPDATE], 2000, 3566.68
[UPDATE], 3000, 3089.595744680851
[UPDATE], 4000, 2953.0204081632655
[UPDATE], 5000, 3088.222222222222
[UPDATE], 6000, 2843.637931034483
[UPDATE], 7000, 2871.8653846153848
[UPDATE], 8000, 2830.4897959183672
[UPDATE], 9000, 2554.190476190476
[UPDATE], 10000, 2102.2115384615386
[UPDATE], 11000, 2589.1666666666665
[UPDATE], 12000, 2696.549019607843
[UPDATE], 13000, 2453.3958333333335
[UPDATE], 14000, 2599.133333333333
[UPDATE], 15000, 2544.910714285714
[UPDATE], 16000, 2485.75
[UPDATE], 17000, 2538.8823529411766
[UPDATE], 18000, 2697.2444444444445
[UPDATE], 19000, 2454.88
[UPDATE], 20000, 2263.7586206896553
[UPDATE], 21000, 2472.5625
[UPDATE], 22000, 2739.470588235294
[UPDATE], 23000, 2567.6458333333335
[UPDATE], 24000, 2458.12
[UPDATE], 25000, 2386.4464285714284
[UPDATE], 26000, 2263.923076923077
[UPDATE], 27000, 2352.02
[UPDATE], 28000, 2559.282608695652
[UPDATE], 29000, 2610.4166666666665
[UPDATE], 30000, 2246.9333333333334
[UPDATE], 31000, 2373.7450980392155
[UPDATE], 32000, 2389.301886792453
[UPDATE], 33000, 2401.981818181818
[UPDATE], 34000, 2339.603773584906
[UPDATE], 35000, 2480.0
[UPDATE], 36000, 2368.362068965517
[UPDATE], 37000, 2502.5
[UPDATE], 38000, 2586.7380952380954
[UPDATE], 39000, 2271.375
[UPDATE], 40000, 2496.0476190476193
[UPDATE], 41000, 2404.409090909091
[UPDATE], 42000, 2465.7321428571427
[UPDATE], 43000, 2250.1346153846152
[UPDATE], 44000, 2541.3414634146343
[UPDATE], 45000, 2358.4444444444443
[UPDATE], 46000, 2494.82
[UPDATE], 47000, 2398.9375
[UPDATE], 48000, 2369.0377358490564
[UPDATE], 49000, 2355.1458333333335
[UPDATE], 50000, 2269.8478260869565
[UPDATE], 51000, 2303.5833333333335
[UPDATE], 52000, 2516.408163265306
[UPDATE], 53000, 2372.7758620689656
[UPDATE], 54000, 2441.225
[UPDATE], 55000, 2366.5208333333335
[UPDATE], 56000, 2329.722222222222
[UPDATE], 57000, 2388.279069767442
[UPDATE], 58000, 2399.081632653061
[UPDATE], 59000, 2258.9821428571427
[UPDATE], 60000, 2402.1346153846152
[UPDATE], 61000, 2402.3333333333335
[UPDATE], 62000, 2332.1052631578946
[UPDATE], 63000, 2426.5576923076924
[UPDATE], 64000, 2335.6363636363635
[UPDATE], 65000, 2439.4074074074074
[UPDATE], 66000, 2352.86
[UPDATE], 67000, 2540.7291666666665
[UPDATE], 68000, 2371.706896551724
[UPDATE], 69000, 2353.5087719298244
[UPDATE], 70000, 2167.285714285714
[UPDATE], 71000, 2313.6470588235293
[UPDATE], 72000, 2355.5714285714284
[UPDATE], 73000, 2340.1702127659573
[UPDATE], 74000, 2359.0222222222224
[UPDATE], 75000, 2456.439024390244
[UPDATE], 76000, 2230.0754716981132
[UPDATE], 77000, 2292.1063829787236
[UPDATE], 78000, 2294.714285714286
[UPDATE], 79000, 2426.0444444444443
[UPDATE], 80000, 2029.6440677966102
[UPDATE], 81000, 2315.2291666666665
[UPDATE], 82000, 2444.2608695652175
[UPDATE], 83000, 2318.6511627906975
[UPDATE], 84000, 2345.3137254901962
[UPDATE], 85000, 2185.0555555555557
[UPDATE], 86000, 2451.7272727272725
[UPDATE], 87000, 2296.2978723404253
[UPDATE], 88000, 2262.462962962963
[UPDATE], 89000, 2205.9333333333334
[UPDATE], 90000, 2151.913043478261
[UPDATE], 91000, 2304.6545454545453
[UPDATE], 92000, 2419.5272727272727
[UPDATE], 93000, 2205.4423076923076
[UPDATE], 94000, 2233.9411764705883
[UPDATE], 95000, 2405.176470588235
[UPDATE], 96000, 2392.9777777777776
[UPDATE], 97000, 2393.195652173913
[UPDATE], 98000, 2388.2
[UPDATE], 99000, 2214.744680851064
[READ], Operations, 4995
[READ], AverageLatency(us), 2121.6574574574574
[READ], MinLatency(us), 827
[READ], MaxLatency(us), 78069
[READ], Return=1, 4995
[READ], 0, 6844.291666666667
[READ], 1000, 2267.6470588235293
[READ], 2000, 2370.18
[READ], 3000, 2186.3584905660377
[READ], 4000, 2243.843137254902
[READ], 5000, 2205.546875
[READ], 6000, 2240.4523809523807
[READ], 7000, 2154.8541666666665
[READ], 8000, 2282.294117647059
[READ], 9000, 2060.9655172413795
[READ], 10000, 1794.7551020408164
[READ], 11000, 2123.8888888888887
[READ], 12000, 2204.081632653061
[READ], 13000, 2381.7884615384614
[READ], 14000, 2087.7818181818184
[READ], 15000, 2135.340909090909
[READ], 16000, 2158.8541666666665
[READ], 17000, 2106.408163265306
[READ], 18000, 2239.163636363636
[READ], 19000, 2121.48
[READ], 20000, 2034.7380952380952
[READ], 21000, 2181.7115384615386
[READ], 22000, 2171.122448979592
[READ], 23000, 2073.3653846153848
[READ], 24000, 2153.28
[READ], 25000, 2133.590909090909
[READ], 26000, 2039.4571428571428
[READ], 27000, 2108.8
[READ], 28000, 2161.037037037037
[READ], 29000, 2135.576923076923
[READ], 30000, 1972.5454545454545
[READ], 31000, 2100.9795918367345
[READ], 32000, 2051.0425531914893
[READ], 33000, 2053.688888888889
[READ], 34000, 2141.5106382978724
[READ], 35000, 2194.5344827586205
[READ], 36000, 2060.3720930232557
[READ], 37000, 2134.358974358974
[READ], 38000, 2114.0
[READ], 39000, 1973.3653846153845
[READ], 40000, 2031.3793103448277
[READ], 41000, 2059.7321428571427
[READ], 42000, 2160.2727272727275
[READ], 43000, 2091.2708333333335
[READ], 44000, 2055.0169491525426
[READ], 45000, 2039.5
[READ], 46000, 2078.1
[READ], 47000, 2033.6538461538462
[READ], 48000, 2118.9148936170213
[READ], 49000, 2028.1538461538462
[READ], 50000, 1985.462962962963
[READ], 51000, 2103.825
[READ], 52000, 2176.901960784314
[READ], 53000, 2077.046511627907
[READ], 54000, 2035.542372881356
[READ], 55000, 2021.9807692307693
[READ], 56000, 2074.31914893617
[READ], 57000, 2033.107142857143
[READ], 58000, 2024.0196078431372
[READ], 59000, 1985.9777777777779
[READ], 60000, 1989.9148936170213
[READ], 61000, 2090.285714285714
[READ], 62000, 2044.5348837209303
[READ], 63000, 2173.5833333333335
[READ], 64000, 2074.0666666666666
[READ], 65000, 2064.063829787234
[READ], 66000, 1926.9795918367347
[READ], 67000, 2073.9615384615386
[READ], 68000, 2102.714285714286
[READ], 69000, 1934.0
[READ], 70000, 1940.4313725490197
[READ], 71000, 2071.204081632653
[READ], 72000, 2071.5686274509803
[READ], 73000, 1974.188679245283
[READ], 74000, 2047.8181818181818
[READ], 75000, 1995.135593220339
[READ], 76000, 2215.5106382978724
[READ], 77000, 2044.8490566037735
[READ], 78000, 2105.1206896551726
[READ], 79000, 2000.2
[READ], 80000, 1758.5853658536585
[READ], 81000, 1999.3846153846155
[READ], 82000, 2036.4074074074074
[READ], 83000, 2015.438596491228
[READ], 84000, 2109.081632653061
[READ], 85000, 2046.2608695652175
[READ], 86000, 2004.982142857143
[READ], 87000, 1973.2641509433963
[READ], 88000, 2051.7608695652175
[READ], 89000, 1933.4545454545455
[READ], 90000, 1747.4814814814815
[READ], 91000, 2047.9333333333334
[READ], 92000, 2038.9333333333334
[READ], 93000, 2009.4583333333333
[READ], 94000, 1939.5510204081634
[READ], 95000, 2057.326530612245
[READ], 96000, 2122.090909090909
[READ], 97000, 1997.648148148148
[READ], 98000, 2076.36
[READ], 99000, 2025.9347826086957
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 181.1
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 1759
[CLEANUP], 0, 181.1
java -cp /tmp/ycsb/YCSB/voldemort/src/main/conf:/tmp/ycsb/YCSB/nosqldb/src/main/conf:/tmp/ycsb/YCSB/mongodb/target/mongodb-binding-0.1.4.jar:/tmp/ycsb/YCSB/mongodb/target/archive-tmp/mongodb-binding-0.1.4.jar:/tmp/ycsb/YCSB/jdbc/src/main/conf:/tmp/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/tmp/ycsb/YCSB/infinispan/src/main/conf:/tmp/ycsb/YCSB/hbase/src/main/conf:/tmp/ycsb/YCSB/gemfire/src/main/conf:/tmp/ycsb/YCSB/dynamodb/conf:/tmp/ycsb/YCSB/core/target/core-0.1.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -P /tmp/ycsb/config/mongodb.conf -P workloads/workloada -P /tmp/ycsb/config/large.dat -s -threads 10 -target 100 -p measurementtype=timeseries -p timeseries.granularity=1000 -t